
// |ーーーーーーーーーーーーーーーーーーーーーーーーー
// | メールのテンプレート
// |ーーーーーーーーーーーーーーーーーーーーーーーーー

module.exports = {

    // 注文確定時
    placed: (data) => ({
        subject: "【FAZE.】ご注文ありがとうございます",
        body: `
=================================
  ご注文確認
=================================
${data.username} 様

この度はご注文ありがとうございます。
内容をご確認のうえ、お支払いをお願いいたします。

--------------------------------------------
【ご注文詳細】
・注文ID：${data.orderNumber}
・合計金額：${data.amount}円
・確認用リンク：${process.env.APP_URL}/orders/${data.orderId}

【お支払い情報】
・決済方法：PayPay
・送金先ID：${process.env.PAYPAY_ID}

※上記IDへご送金をお願いいたします。
--------------------------------------------

こちらは、送信専用です。
ご不明な点やお問い合わせは、下記までお願いいたします。
お問い合わせ：my.faze.store@gmail.com
    `
    }),

    // 支払い確定時
    paid: (data) => ({
        subject: "【FAZE.】お支払いを確認しました",
        body: `
=================================
  お支払い確認のお知らせ
=================================
${data.username} 様

お支払いを確認いたしました。ありがとうございます。
現在、商品の発送準備を進めております。

【注文詳細】
・注文ID：${data.orderNumber}
・確認リンク：${process.env.APP_URL}/orders/${data.orderId}

発送まで今しばらくお待ちください。

--------------------------------------------

こちらは、送信専用です。
ご不明な点やお問い合わせは、下記までお願いいたします。
お問い合わせ：my.faze.store@gmail.com
    `
    }),

    // 商品到着時
    arrived: (data) => ({
        subject: "【FAZE.】商品が到着しました",
        body: `
=================================
  商品到着のお知らせ
=================================
${data.username} 様

商品が到着しました。

【注文詳細】
・注文ID：${data.orderNumber}
・確認リンク：${process.env.APP_URL}/orders/${data.orderId}

--------------------------------------------

こちらは、送信専用です。
ご不明な点やお問い合わせは、下記までお願いいたします。
お問い合わせ：my.faze.store@gmail.com
        `
    }),

    // 発送完了
    delivered: (data) => ({
        subject: "【FAZE.】商品のお届けが完了しました",
        body: `
=================================
  お届け完了のお知らせ
=================================
${data.username} 様

この度は FAZE. をご利用いただきありがとうございました。
商品のお届けが完了しました。

【注文詳細】
・注文ID：${data.orderNumber}
・確認リンク：${process.env.APP_URL}/orders/${data.orderId}

またのご利用をお待ちしております。
--------------------------------------------

こちらは、送信専用です。
ご不明な点やお問い合わせは、下記までお願いいたします。
お問い合わせ：my.faze.store@gmail.com
        `
    }),

    // 注文キャンセル時
    cancelled: (data) => ({
        subject: "【FAZE.】ご注文キャンセルのご案内",
        body: `
=================================
  ご注文キャンセルのお知らせ
=================================
${data.username} 様

お支払い期限を超過したため、注文をキャンセルいたしました。

【注文詳細】
・注文ID：${data.orderNumber}
・確認リンク：${process.env.APP_URL}/orders/${data.orderId}

またのご利用をお待ちしております。
--------------------------------------------

こちらは、送信専用です。
ご不明な点やお問い合わせは、下記までお願いいたします。
お問い合わせ：my.faze.store@gmail.com
        `
    }),
}
